package Training.Training_09;

/*
 * Java 연습 문제 9
 * - 바위/가위/보 게임 제작하기
 * - 사용자로부터 바위/가위/보 중 하나를 입력받는다
 * - 컴퓨터는 바위/가위/보 중 하나를 랜덤하게 선택한다
 * - 사용자가 이기거나 비겼을 경우 게임을 다시 진행한다
 * - 사용자가 패배했을 경우 전적 출력 후 게임을 종료한다
 *
 * Ex)
 * 정수 (1. 바위, 2. 가위, 3. 보) 입력 : 1
 * 결과 : 승리 (나 - 바위, 컴퓨터 - 가위)
 *
 * 정수 (1. 바위, 2. 가위, 3. 보) 입력 : 2
 * 결과 : 무승부 (나 - 가위, 컴퓨터 - 가위)
 *
 * 정수 (1. 바위, 2. 가위, 3. 보) 입력 : 3
 * 결과 : 패배 (나 - 보, 컴퓨터 - 가위)
 *
 * 전적 : 1 승 1 무 1 패
 * 프로그램을 종료합니다.
 */

/**
 * Training 9
 */
public class CT01Training_09 {
	/** 초기화 */
	public static void start(String[] args) {
		// Do Something
	}
}
