package Training.Training_06;

/*
 * Java 연습 문제 6
 * - 다양한 형태 출력하기
 * - 라인 수를 입력 받아 해당 라인만큼 다양한 형태 출력하기
 *
 * Ex)
 * 라인 수 입력 : 5
 * *   *
 *  * *
 *   *
 *  * *
 * *   *
 *
 * *****
 *    *
 *   *
 *  *
 * *****
 *
 * *   *
 * **  *
 * * * *
 * *  **
 * *   *
 *
 * *
 * **
 * ***
 * ****
 * *****
 *
 * *****
 * ****
 * ***
 * **
 * *
 *
 *     *
 *    **
 *   ***
 *  ****
 * *****
 *
 * *****
 *  ****
 *   ***
 *    **
 *     *
 *
 *     *
 *    ***
 *   *****
 *  *******
 * *********
 *
 * *********
 *  *******
 *   *****
 *    ***
 *     *
 */

/**
 * Training 6
 */
public class CT01Training_06 {
	/** 초기화 */
	public static void start(String[] args) {
		// Do Something
	}
}
